HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPort_reg.h
/** \\brief  94, Port Output Modification Clear Register */
#define P14_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003B494u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P14_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003B480u)


/** \\brief  84, Port Output Modification Clear Register 4 */
#define P14_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003B484u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P14_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003B488u)

/** \\brief  4, Port Output Modification Register */
#define P14_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003B404u)

/** \\brief  90, Port Output Modification Set Register */
#define P14_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003B490u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P14_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003B470u)


/** \\brief  74, Port Output Modification Set Register 4 */
#define P14_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003B474u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P14_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003B478u)

/** \\brief  0, Port Output Register */
#define P14_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003B400u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P14_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003B440u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P14_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003B444u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P15
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P15_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B5FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P15_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003B5F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P15_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003B550u)

/** \\brief  8, Identification Register */
#define P15_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003B508u)

/** \\brief  24, Port Input Register */
#define P15_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003B524u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P15_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003B510u)


/** \\brief  14, Port Input/Output Control Register 4 */
#define P15_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003B514u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P15_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003B518u)




/** \\brief  94, Port Output Modification Clear Register */
#define P15_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003B594u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P15_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003B580u)


/** \\brief  84, Port Output Modification Clear Register 4 */
#define P15_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003B584u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P15_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003B588u)

/** \\brief  4, Port Output Modification Register */
#define P15_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003B504u)

/** \\brief  90, Port Output Modification Set Register */
#define P15_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003B590u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P15_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003B570u)


/** \\brief  74, Port Output Modification Set Register 4 */
#define P15_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003B574u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P15_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003B578u)

/** \\brief  0, Port Output Register */
#define P15_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003B500u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P15_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003B540u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P15_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003B544u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P20
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P20_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C0FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P20_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C0F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P20_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C050u)

/** \\brief  8, Identification Register */
#define P20_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C008u)

/** \\brief  24, Port Input Register */
#define P20_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C024u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P20_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C010u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P20_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003C01Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P20_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C014u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P20_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003C018u)




/** \\brief  94, Port Output Modification Clear Register */
#define P20_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C094u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P20_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C080u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P20_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003C08Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P20_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C084u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P20_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003C088u)

/** \\brief  4, Port Output Modification Register */
#define P20_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C004u)

/** \\brief  90, Port Output Modification Set Register */
#define P20_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C090u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P20_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C070u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P20_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003C07Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P20_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C074u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P20_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003C078u)

