HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P20_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C000u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P20_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C040u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P20_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P21
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P21_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C1FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P21_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C1F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P21_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C150u)

/** \\brief  8, Identification Register */
#define P21_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C108u)

/** \\brief  24, Port Input Register */
#define P21_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C124u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P21_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C110u)


/** \\brief  14, Port Input/Output Control Register 4 */
#define P21_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C114u)



/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P21_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003C1A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P21_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003C1A8u)

/** \\brief  94, Port Output Modification Clear Register */
#define P21_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C194u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P21_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C180u)


/** \\brief  84, Port Output Modification Clear Register 4 */
#define P21_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C184u)


/** \\brief  4, Port Output Modification Register */
#define P21_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C104u)

/** \\brief  90, Port Output Modification Set Register */
#define P21_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C190u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P21_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C170u)


/** \\brief  74, Port Output Modification Set Register 4 */
#define P21_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C174u)


/** \\brief  0, Port Output Register */
#define P21_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C100u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P21_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C140u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P22
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P22_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C2FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P22_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C2F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P22_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C250u)

/** \\brief  8, Identification Register */
#define P22_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C208u)

/** \\brief  24, Port Input Register */
#define P22_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C224u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P22_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C210u)




/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P22_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003C2A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P22_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003C2A4u)


/** \\brief  94, Port Output Modification Clear Register */
#define P22_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C294u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P22_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C280u)




/** \\brief  4, Port Output Modification Register */
#define P22_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C204u)

/** \\brief  90, Port Output Modification Set Register */
#define P22_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C290u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P22_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C270u)




/** \\brief  0, Port Output Register */
#define P22_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C200u)



/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P22_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C240u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P23
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P23_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C3FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P23_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C3F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P23_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C350u)

/** \\brief  8, Identification Register */
#define P23_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C308u)

/** \\brief  24, Port Input Register */
#define P23_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C324u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P23_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C310u)


/** \\brief  14, Port Input/Output Control Register 4 */
#define P23_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C314u)





